<template>
  <div class="w-screen h-screen flex items-start justify-center">
    <div
      class="container flex flex-col gap-5 p-12 items-center w-fit shadow-xl rounded-2xl border mt-24 border-slate-200"
    >
      <img src="@/assets/logo_transparent.png" class="w-1/2" />
      <h1 class="font-bold text-3xl text-slate-700 mb-5">Авторизация</h1>
      <template v-if="!isCode">
        <div class="grid grid-cols-2 gap-2">
          <SelectorVue
            :options_props="codes.list"
            :selected_option="codes.selected"
            @select="codes.select"
          />
          <input
            class="input"
            :class="{ input_error: isErrorInput }"
            v-model="imask.numberModel"
            masked="false"
            v-mask="imask.mask"
            :placeholder="imask.mask"
          />
        </div>
        <div class="w-full flex justify-center mt-5">
          <button class="btn btn_blue" @click="submit()">Отправить код</button>
        </div>
      </template>
      <template v-else> 123 </template>
    </div>
  </div>
</template>

<script>
import SelectorVue from "@/components/SelectorVue.vue";
import { reactive, ref } from "vue";

export default {
  components: { SelectorVue },
  setup() {
    const isCode = ref(false);

    const imask = reactive({
      mask: Number,
      numberModel: "",
    });

    const codes = reactive({
      selected: {},
      list: [
        { name: "+7 🇷🇺 - Россия", phone: "+7 (###) ###-##-##" },
        { name: "+380 🇺🇦 - Украина", phone: "+380 (##) ###-##-##" },
        {
          name: "+375 🇧🇾 - Беларусь (Белоруссия)",
          phone: "+375 (##) ###-##-##",
        },
        { name: "+7 🇰🇿 - Казахстан", phone: "+7 (###) ###-##-##" },
        { name: "+998 🇺🇿 - Узбекистан", phone: "+998-##-###-####" },
        { name: "+995 🇬🇪 - Грузия", phone: "+995 (###) ###-###" },
        { name: "+371 🇱🇻 - Латвия", phone: "+371-##-###-###" },
        { name: "+373 🇲🇩 - Молдова", phone: "+373-####-####" },
        { name: "+996 🇰🇬 - Киргизия", phone: "+996 (###) ###-###" },
        { name: "+992 🇹🇯 - Таджикистан", phone: "+992-##-###-####" },
        { name: "+374 🇦🇲 - Армения", phone: "+374-##-###-###" },
        { name: "+993 🇹🇲 - Туркменистан", phone: "+993-#-###-####" },
        { name: "+372 🇪🇪 - Эстония ", phone: "+372-####-####" },
        { name: "+1 🇺🇸 - США", phone: "+1 (###) ###-####" },
        { name: "+1 🇨🇦 - Канада", phone: "+1 (###) ###-####" },
        { name: "+49 🇩🇪 - Германия", phone: "+49 (###) ###-#####" },
        { name: "+33 🇫🇷 - Франция", phone: "+33 (###) ###-###" },
        { name: "+44 🇬🇧 - Великобритания", phone: "+44-##-####-####" },
        { name: "+34 🇪🇸 - Испания", phone: "+34 (###) ###-###" },
        { name: "+358 🇫🇮 - Финляндия", phone: "+358 (###) ###-##-##" },
        { name: "+247 🇦🇨 - Остров Вознесения", phone: "+247-####" },
        { name: "+376 🇦🇩 - Андорра", phone: "+376-###-###" },
        {
          name: "+9715 🇦🇪 - Объединенные Арабские Эмираты",
          phone: "+971-5#-###-####",
        },
        {
          name: "+971 🇦🇪 - Объединенные Арабские Эмираты",
          phone: "+971-#-###-####",
        },
        { name: "+93 🇦🇫 - Афганистан", phone: "+93-##-###-####" },
        { name: "+1268 🇦🇬 - Антигуа и Барбуда", phone: "+1(268)###-####" },
        { name: "+1264 🇦🇮 - Ангилья", phone: "+1(264)###-####" },
        { name: "+355 🇦🇱 - Албания", phone: "+355(###)###-###" },
        { name: "+599 🇧🇶 - Карибские Нидерланды", phone: "+599-###-####" },
        {
          name: "+599 🇳🇱 - Нидерландские Антильские острова",
          phone: "+599-###-####",
        },
        {
          name: "+5999 🇳🇱 - Нидерландские Антильские острова",
          phone: "+599-9###-####",
        },
        { name: "+244 🇦🇴 - Ангола", phone: "+244(###)###-###" },
        {
          name: "+6721 🇦🇶 - Австралийская антарктическая база",
          phone: "+672-1##-###",
        },
        { name: "+54 🇦🇷 - Аргентина", phone: "+54(###)###-####" },
        { name: "+1684 🇦🇸 - Американское Самоа", phone: "+1(684)###-####" },
        { name: "+43 🇦🇹 - Австрия", phone: "+43(###)###-####" },
        { name: "+61 🇦🇺 - Австралия", phone: "+61-#-####-####" },
        { name: "+297 🇦🇼 - Аруба", phone: "+297-###-####" },
        { name: "+994 🇦🇿 - Азербайджан", phone: "+994-##-###-##-##" },
        { name: "+387 🇧🇦 - Босния и Герцеговина", phone: "+387-##-#####" },
        { name: "+387 🇧🇦 - Босния и Герцеговина", phone: "+387-##-####" },
        { name: "+1246 🇧🇧 - Барбадос", phone: "+1(246)###-####" },
        { name: "+880 🇧🇩 - Бангладеш", phone: "+880-##-###-###" },
        { name: "+32 🇧🇪 - Бельгия", phone: "+32(###)###-###" },
        { name: "+226 🇧🇫 - Буркина Фасо", phone: "+226-##-##-####" },
        { name: "+359 🇧🇬 - Болгария", phone: "+359(###)###-###" },
        { name: "+973 🇧🇭 - Бахрейн", phone: "+973-####-####" },
        { name: "+257 🇧🇮 - Бурунди", phone: "+257-##-##-####" },
        { name: "+229 🇧🇯 - Бенин", phone: "+229-##-##-####" },
        { name: "+1441 🇧🇲 - Бермудские острова", phone: "+1(441)###-####" },
        { name: "+673 🇧🇳 - Бруней-Даруссалам", phone: "+673-###-####" },
        { name: "+591 🇧🇴 - Боливия", phone: "+591-#-###-####" },
        { name: "+55 🇧🇷 - Бразилия", phone: "+55(##)####-####" },
        { name: "+557 🇧🇷 - Бразилия", phone: "+55(##)7###-####" },
        { name: "+559 🇧🇷 - Бразилия", phone: "+55(##)9####-####" },
        { name: "+1242 🇧🇸 - Багамские Острова", phone: "+1(242)###-####" },
        { name: "+97517 🇧🇹 - Бутан", phone: "+975-17-###-###" },
        { name: "+975 🇧🇹 - Бутан", phone: "+975-#-###-###" },
        { name: "+267 🇧🇼 - Ботсвана", phone: "+267-##-###-###" },
        { name: "+501 🇧🇿 - Белиз", phone: "+501-###-####" },
        {
          name: "+243 🇨🇬 - Дем. Респ. Конго (Киншаса)",
          phone: "+243(###)###-###",
        },
        {
          name: "+236 🇨🇫 - Центральноафриканская Республика",
          phone: "+236-##-##-####",
        },
        { name: "+242 🇨🇬 - Конго (Браззавиль)", phone: "+242-##-###-####" },
        { name: "+41 🇨🇭 - Швейцария", phone: "+41-##-###-####" },
        { name: "+225 🇨🇮 - Кот-д’Ивуар", phone: "+225-##-###-###" },
        { name: "+682 🇨🇰 - Острова Кука", phone: "+682-##-###" },
        { name: "+56 🇨🇱 - Чили", phone: "+56-#-####-####" },
        { name: "+237 🇨🇲 - Камерун", phone: "+237-####-####" },
        { name: "+86 🇨🇳 - Китайская Н.Р.", phone: "+86(###)####-####" },
        { name: "+86 🇨🇳 - Китайская Н.Р.", phone: "+86(###)####-###" },
        { name: "+86 🇨🇳 - Китайская Н.Р.", phone: "+86-##-#####-#####" },
        { name: "+57 🇨🇴 - Колумбия", phone: "+57(###)###-####" },
        { name: "+506 🇨🇷 - Коста-Рика", phone: "+506-####-####" },
        { name: "+53 🇨🇺 - Куба", phone: "+53-#-###-####" },
        { name: "+238 🇨🇻 - Кабо-Верде", phone: "+238(###)##-##" },
        { name: "+599 🇨🇼 - Кюрасао", phone: "+599-###-####" },
        { name: "+357 🇨🇾 - Кипр", phone: "+357-##-###-###" },
        { name: "+420 🇨🇿 - Чехия", phone: "+420(###)###-###" },
        { name: "+253 🇩🇯 - Джибути", phone: "+253-##-##-##-##" },
        { name: "+45 🇩🇰 - Дания", phone: "+45-##-##-##-##" },
        { name: "+1767 🇩🇲 - Доминика", phone: "+1(767)###-####" },
        {
          name: "+1809 🇩🇴 - Доминиканская Республика",
          phone: "+1(809)###-####",
        },
        {
          name: "+1829 🇩🇴 - Доминиканская Республика",
          phone: "+1(829)###-####",
        },
        {
          name: "+1849 🇩🇴 - Доминиканская Республика",
          phone: "+1(849)###-####",
        },
        { name: "+213 🇩🇿 - Алжир", phone: "+213-##-###-####" },
        { name: "+593 🇪🇨 - Эквадор", phone: "+593-##-###-####" },
        { name: "+593 🇪🇨 - Эквадор", phone: "+593-#-###-####" },
        { name: "+20 🇪🇬 - Египет", phone: "+20(###)###-####" },
        { name: "+291 🇪🇷 - Эритрея", phone: "+291-#-###-###" },
        { name: "+251 🇪🇹 - Эфиопия", phone: "+251-##-###-####" },
        { name: "+679 🇫🇯 - Фиджи", phone: "+679-##-#####" },
        { name: "+500 🇫🇰 - Фолклендские острова", phone: "+500-#####" },
        { name: "+691 🇫🇲 - Ф.Ш. Микронезии", phone: "+691-###-####" },
        { name: "+298 🇫🇴 - Фарерские острова", phone: "+298-###-###" },
        { name: "+262 🇾🇹 - Майотта", phone: "+262-#####-####" },
        { name: "+508 🇵🇲 - Сен-Пьер и Микелон", phone: "+508-##-####" },
        { name: "+590 🇬🇵 - Гваделупа", phone: "+590(###)###-###" },
        { name: "+241 🇬🇦 - Габон", phone: "+241-#-##-##-##" },
        { name: "+1473 🇬🇩 - Гренада", phone: "+1(473)###-####" },
        { name: "+594 🇬🇫 - Фр. Гвиана", phone: "+594-#####-####" },
        { name: "+233 🇬🇭 - Гана", phone: "+233(###)###-###" },
        { name: "+350 🇬🇮 - Гибралтар", phone: "+350-###-#####" },
        { name: "+299 🇬🇱 - Гренландия", phone: "+299-##-##-##" },
        { name: "+220 🇬🇲 - Гамбия", phone: "+220(###)##-##" },
        { name: "+224 🇬🇳 - Гвинея", phone: "+224-##-###-###" },
        { name: "+240 🇬🇶 - Экваториальная Гвинея", phone: "+240-##-###-####" },
        { name: "+30 🇬🇷 - Греция", phone: "+30(###)###-####" },
        { name: "+502 🇬🇹 - Гватемала", phone: "+502-#-###-####" },
        { name: "+1671 🇬🇺 - Гуам", phone: "+1(671)###-####" },
        { name: "+245 🇬🇼 - Гвинея-Бисау", phone: "+245-#-######" },
        { name: "+592 🇬🇾 - Гайана", phone: "+592-###-####" },
        { name: "+852 🇭🇰 - Гонконг", phone: "+852-####-####" },
        { name: "+504 🇭🇳 - Гондурас", phone: "+504-####-####" },
        { name: "+385 🇭🇷 - Хорватия", phone: "+385-##-###-###" },
        { name: "+509 🇭🇹 - Гаити", phone: "+509-##-##-####" },
        { name: "+36 🇭🇺 - Венгрия", phone: "+36(###)###-###" },
        { name: "+628 🇮🇩 - Индонезия ", phone: "+62(8##)###-####" },
        { name: "+62 🇮🇩 - Индонезия", phone: "+62-##-###-##" },
        { name: "+62 🇮🇩 - Индонезия", phone: "+62-##-###-###" },
        { name: "+62 🇮🇩 - Индонезия", phone: "+62-##-###-####" },
        { name: "+628 🇮🇩 - Индонезия ", phone: "+62(8##)###-###" },
        { name: "+628 🇮🇩 - Индонезия ", phone: "+62(8##)###-##-###" },
        { name: "+353 🇮🇪 - Ирландия", phone: "+353(###)###-###" },
        { name: "+9725 🇮🇱 - Израиль ", phone: "+972-5#-###-####" },
        { name: "+972 🇮🇱 - Израиль", phone: "+972-#-###-####" },
        { name: "+91 🇮🇳 - Индия", phone: "+91(####)###-###" },
        { name: "+246 🇩🇬 - Диего-Гарсия", phone: "+246-###-####" },
        { name: "+964 🇮🇶 - Ирак", phone: "+964(###)###-####" },
        { name: "+98 🇮🇷 - Иран", phone: "+98(###)###-####" },
        { name: "+354 🇮🇸 - Исландия", phone: "+354-###-####" },
        { name: "+39 🇮🇹 - Италия", phone: "+39(###)####-###" },
        { name: "+1876 🇯🇲 - Ямайка", phone: "+1(876)###-####" },
        { name: "+962 🇯🇴 - Иордания", phone: "+962-#-####-####" },
        { name: "+81 🇯🇵 - Япония ", phone: "+81-##-####-####" },
        { name: "+81 🇯🇵 - Япония", phone: "+81(###)###-###" },
        { name: "+254 🇰🇪 - Кения", phone: "+254-###-######" },
        { name: "+855 🇰🇭 - Камбоджа", phone: "+855-##-###-###" },
        { name: "+686 🇰🇮 - Кирибати", phone: "+686-##-###" },
        { name: "+269 🇰🇲 - Коморы", phone: "+269-##-#####" },
        { name: "+1869 🇰🇳 - Сент-Китс и Невис", phone: "+1(869)###-####" },
        { name: "+850191 🇰🇳 - Корейская НДР", phone: "+850-191-###-####" },
        { name: "+850 🇰🇵 - Корейская НДР", phone: "+850-##-###-###" },
        { name: "+850 🇰🇵 - Корейская НДР", phone: "+850-###-####-###" },
        { name: "+850 🇰🇵 - Корейская НДР", phone: "+850-###-###" },
        { name: "+850 🇰🇵 - Корейская НДР", phone: "+850-####-####" },
        { name: "+850 🇰🇵 - Корейская НДР", phone: "+850-####-#############" },
        { name: "+82 🇰🇷 - Респ. Корея", phone: "+82-##-###-####" },
        { name: "+965 🇰🇼 - Кувейт", phone: "+965-####-####" },
        { name: "+1345 🇰🇾 - Каймановы острова", phone: "+1(345)###-####" },
        { name: "+76 🇰🇿 - Казахстан", phone: "+7(6##)###-##-##" },
        { name: "+77 🇰🇿 - Казахстан", phone: "+7(7##)###-##-##" },
        { name: "+85620 🇱🇦 - Лаос", phone: "+856(20##)###-###" },
        { name: "+856 🇱🇦 - Лаос", phone: "+856-##-###-###" },
        { name: "+961 🇱🇧 - Ливан ", phone: "+961-##-###-###" },
        { name: "+961 🇱🇧 - Ливан", phone: "+961-#-###-###" },
        { name: "+1758 🇱🇨 - Сент-Люсия", phone: "+1(758)###-####" },
        { name: "+423 🇱🇮 - Лихтенштейн", phone: "+423(###)###-####" },
        { name: "+94 🇱🇰 - Шри-Ланка", phone: "+94-##-###-####" },
        { name: "+231 🇱🇷 - Либерия", phone: "+231-##-###-###" },
        { name: "+266 🇱🇸 - Лесото", phone: "+266-#-###-####" },
        { name: "+370 🇱🇹 - Литва", phone: "+370(###)##-###" },
        { name: "+352 🇱🇺 - Люксембург", phone: "+352(###)###-###" },
        { name: "+218 🇱🇾 - Ливия", phone: "+218-##-###-###" },
        { name: "+21821 🇱🇾 - Ливия", phone: "+218-21-###-####" },
        { name: "+212 🇲🇦 - Марокко", phone: "+212-##-####-###" },
        { name: "+377 🇲🇨 - Монако", phone: "+377(###)###-###" },
        { name: "+377 🇲🇨 - Монако", phone: "+377-##-###-###" },
        { name: "+382 🇲🇪 - Черногория", phone: "+382-##-###-###" },
        { name: "+261 🇲🇬 - Мадагаскар", phone: "+261-##-##-#####" },
        { name: "+692 🇲🇭 - Маршалловы Острова", phone: "+692-###-####" },
        { name: "+389 🇲🇰 - Респ. Македония", phone: "+389-##-###-###" },
        { name: "+223 🇲🇱 - Мали", phone: "+223-##-##-####" },
        { name: "+95 🇲🇲 - Бирма (Мьянма)", phone: "+95-##-###-###" },
        { name: "+95 🇲🇲 - Бирма (Мьянма)", phone: "+95-#-###-###" },
        { name: "+95 🇲🇲 - Бирма (Мьянма)", phone: "+95-###-###" },
        { name: "+976 🇲🇳 - Монголия", phone: "+976-##-##-####" },
        { name: "+853 🇲🇴 - Макао", phone: "+853-####-####" },
        {
          name: "+1670 🇲🇵 - Северные Марианские острова Сайпан",
          phone: "+1(670)###-####",
        },
        { name: "+596 🇲🇶 - Мартиника", phone: "+596(###)##-##-##" },
        { name: "+222 🇲🇷 - Мавритания", phone: "+222-##-##-####" },
        { name: "+1664 🇲🇸 - Монтсеррат", phone: "+1(664)###-####" },
        { name: "+356 🇲🇹 - Мальта", phone: "+356-####-####" },
        { name: "+230 🇲🇺 - Маврикий", phone: "+230-###-####" },
        { name: "+960 🇲🇻 - Мальдивские острова", phone: "+960-###-####" },
        { name: "+2651 🇲🇼 - Малави", phone: "+265-1-###-###" },
        { name: "+265 🇲🇼 - Малави", phone: "+265-#-####-####" },
        { name: "+52 🇲🇽 - Мексика", phone: "+52(###)###-####" },
        { name: "+52 🇲🇽 - Мексика", phone: "+52-##-##-####" },
        { name: "+60 🇲🇾 - Малайзия ", phone: "+60-##-###-####" },
        { name: "+60 🇲🇾 - Малайзия", phone: "+60(###)###-###" },
        { name: "+60 🇲🇾 - Малайзия", phone: "+60-##-###-###" },
        { name: "+60 🇲🇾 - Малайзия", phone: "+60-#-###-###" },
        { name: "+258 🇲🇿 - Мозамбик", phone: "+258-##-###-###" },
        { name: "+264 🇳🇦 - Намибия", phone: "+264-##-###-####" },
        { name: "+687 🇳🇨 - Новая Каледония", phone: "+687-##-####" },
        { name: "+227 🇳🇪 - Нигер", phone: "+227-##-##-####" },
        { name: "+6723 🇳🇫 - Норфолк (остров)", phone: "+672-3##-###" },
        { name: "+234 🇳🇬 - Нигерия", phone: "+234(###)###-####" },
        { name: "+234 🇳🇬 - Нигерия", phone: "+234-##-###-###" },
        { name: "+234 🇳🇬 - Нигерия", phone: "+234-##-###-##" },
        { name: "+234 🇳🇬 - Нигерия ", phone: "+234(###)###-####" },
        { name: "+505 🇳🇮 - Никарагуа", phone: "+505-####-####" },
        { name: "+31 🇳🇱 - Нидерланды", phone: "+31-##-###-####" },
        { name: "+47 🇳🇴 - Норвегия", phone: "+47(###)##-###" },
        { name: "+977 🇳🇵 - Непал", phone: "+977-##-###-###" },
        { name: "+674 🇳🇷 - Науру", phone: "+674-###-####" },
        { name: "+683 🇳🇺 - Ниуэ", phone: "+683-####" },
        { name: "+64 🇳🇿 - Новая Зеландия", phone: "+64(###)###-###" },
        { name: "+64 🇳🇿 - Новая Зеландия", phone: "+64-##-###-###" },
        { name: "+64 🇳🇿 - Новая Зеландия", phone: "+64(###)###-####" },
        { name: "+968 🇴🇲 - Оман", phone: "+968-##-###-###" },
        { name: "+507 🇵🇦 - Панама", phone: "+507-###-####" },
        { name: "+51 🇵🇪 - Перу", phone: "+51(###)###-###" },
        {
          name: "+689 🇵🇫 - Французская Полинезия (Таити)",
          phone: "+689-##-##-##",
        },
        { name: "+675 🇵🇬 - Папуа-Новая Гвинея", phone: "+675(###)##-###" },
        { name: "+63 🇵🇭 - Филиппины", phone: "+63(###)###-####" },
        { name: "+92 🇵🇰 - Пакистан", phone: "+92(###)###-####" },
        { name: "+48 🇵🇱 - Польша", phone: "+48(###)###-###" },
        { name: "+970 🇵🇸 - Палестина", phone: "+970-##-###-####" },
        { name: "+351 🇵🇹 - Португалия", phone: "+351-##-###-####" },
        { name: "+680 🇵🇼 - Палау", phone: "+680-###-####" },
        { name: "+595 🇵🇾 - Парагвай", phone: "+595(###)###-###" },
        { name: "+974 🇶🇦 - Катар", phone: "+974-####-####" },
        { name: "+262 🇷🇪 - Реюньон", phone: "+262-#####-####" },
        { name: "+40 🇷🇴 - Румыния", phone: "+40-##-###-####" },
        { name: "+381 🇷🇸 - Сербия", phone: "+381-##-###-####" },
        { name: "+250 🇷🇼 - Руанда", phone: "+250(###)###-###" },
        { name: "+9665 🇸🇦 - Саудовская Аравия ", phone: "+966-5-####-####" },
        { name: "+966 🇸🇦 - Саудовская Аравия", phone: "+966-#-###-####" },
        { name: "+677 🇸🇧 - Соломоновы Острова ", phone: "+677-###-####" },
        { name: "+677 🇸🇧 - Соломоновы Острова", phone: "+677-#####" },
        { name: "+248 🇸🇨 - Сейшелы", phone: "+248-#-###-###" },
        { name: "+249 🇸🇩 - Судан", phone: "+249-##-###-####" },
        { name: "+46 🇸🇪 - Швеция", phone: "+46-##-###-####" },
        { name: "+6565 🇸🇬 - Сингапур", phone: "+65 65 #######" },
        { name: "+290 🇸🇭 - Остров Святой Елены", phone: "+290-####" },
        { name: "+290 🇹🇦 - Тристан-да-Кунья", phone: "+290-####" },
        { name: "+386 🇸🇮 - Словения", phone: "+386-##-###-###" },
        { name: "+421 🇸🇰 - Словакия", phone: "+421(###)###-###" },
        { name: "+232 🇸🇱 - Сьерра-Леоне", phone: "+232-##-######" },
        { name: "+378 🇸🇲 - Сан-Марино", phone: "+378-####-######" },
        { name: "+221 🇸🇳 - Сенегал", phone: "+221-##-###-####" },
        { name: "+252 🇸🇴 - Сомали", phone: "+252-##-###-###" },
        { name: "+252 🇸🇴 - Сомали", phone: "+252-#-###-###" },
        { name: "+252 🇸🇴 - Сомали", phone: "+252-#-###-###" },
        { name: "+597 🇸🇷 - Суринам", phone: "+597-###-####" },
        { name: "+597 🇸🇷 - Суринам", phone: "+597-###-###" },
        { name: "+211 🇸🇸 - Южный Судан", phone: "+211-##-###-####" },
        { name: "+239 🇸🇹 - Сан-Томе и Принсипи", phone: "+239-##-#####" },
        { name: "+503 🇸🇻 - Сальвадор", phone: "+503-##-##-####" },
        { name: "+1721 🇸🇽 - Синт-Маартен", phone: "+1(721)###-####" },
        {
          name: "+963 🇸🇾 - Сирия (Сирийская арабская республика)",
          phone: "+963-##-####-###",
        },
        { name: "+268 🇸🇿 - Свазиленд", phone: "+268-##-##-####" },
        { name: "+1649 🇹🇨 - Тёркс и Кайкос", phone: "+1(649)###-####" },
        { name: "+235 🇹🇩 - Чад", phone: "+235-##-##-##-##" },
        { name: "+228 🇹🇬 - Того", phone: "+228-##-###-###" },
        { name: "+66 🇹🇭 - Таиланд ", phone: "+66-##-###-####" },
        { name: "+66 🇹🇭 - Таиланд", phone: "+66-##-###-###" },
        { name: "+690 🇹🇰 - Токелау", phone: "+690-####" },
        { name: "+670 🇹🇱 - Восточный Тимор", phone: "+670-###-####" },
        { name: "+67077 🇹🇱 - Восточный Тимор", phone: "+670-77#-#####" },
        { name: "+67078 🇹🇱 - Восточный Тимор", phone: "+670-78#-#####" },
        { name: "+216 🇹🇳 - Тунис", phone: "+216-##-###-###" },
        { name: "+676 🇹🇴 - Тонга", phone: "+676-#####" },
        { name: "+90 🇹🇷 - Турция", phone: "+90(###)###-####" },
        { name: "+1868 🇹🇹 - Тринидад и Тобаго", phone: "+1(868)###-####" },
        { name: "+68890 🇹🇻 - Тувалу ", phone: "+688-90####" },
        { name: "+6882 🇹🇻 - Тувалу", phone: "+688-2####" },
        { name: "+886 🇹🇼 - Тайвань", phone: "+886-#-####-####" },
        { name: "+886 🇹🇼 - Тайвань", phone: "+886-####-####" },
        { name: "+255 🇹🇿 - Танзания", phone: "+255-##-###-####" },
        { name: "+256 🇺🇬 - Уганда", phone: "+256(###)###-###" },
        { name: "+598 🇺🇾 - Уругвай", phone: "+598-#-###-##-##" },
        { name: "+396698 🇻🇦 - Ватикан", phone: "+39-6-698-#####" },
        {
          name: "+1784 🇻🇨 - Сент-Винсент и Гренадины",
          phone: "+1(784)###-####",
        },
        { name: "+58 🇻🇪 - Венесуэла", phone: "+58(###)###-####" },
        {
          name: "+1284 🇻🇬 - Британские Виргинские острова",
          phone: "+1(284)###-####",
        },
        {
          name: "+1340 🇻🇮 - Американские Виргинские острова",
          phone: "+1(340)###-####",
        },
        { name: "+84 🇻🇳 - Вьетнам", phone: "+84-##-####-###" },
        { name: "+84 🇻🇳 - Вьетнам", phone: "+84(###)####-###" },
        { name: "+678 🇻🇺 - Вануату ", phone: "+678-##-#####" },
        { name: "+678 🇻🇺 - Вануату", phone: "+678-#####" },
        { name: "+681 🇼🇫 - Уоллис и Футуна", phone: "+681-##-####" },
        { name: "+685 🇼🇸 - Самоа", phone: "+685-##-####" },
        { name: "+967 🇾🇪 - Йемен ", phone: "+967-###-###-###" },
        { name: "+967 🇾🇪 - Йемен", phone: "+967-#-###-###" },
        { name: "+967 🇾🇪 - Йемен", phone: "+967-##-###-###" },
        { name: "+27 🇿🇦 - Южно-Африканская Респ.", phone: "+27-##-###-####" },
        { name: "+260 🇿🇲 - Замбия", phone: "+260-##-###-####" },
        { name: "+263 🇿🇼 - Зимбабве", phone: "+263-#-######" },
      ],
      select: (option) => {
        codes.selected = { ...option, value: 1 };
        imask.numberModel = "";
        imask.mask = option.phone;
      },
    });

    codes.select(codes.list[0]);

    const deleteOther = (str) => {
      str = str.replaceAll(" ", "");
      str = str.replaceAll("(", "");
      str = str.replaceAll(")", "");
      str = str.replaceAll("-", "");
      return str;
    };

    const isErrorInput = ref(false);

    const submit = () => {
      const checked =
        deleteOther(imask.numberModel).length ==
        deleteOther(codes.selected.phone).length;
      if (checked) {
        isCode.value = true;
      } else {
        isErrorInput.value = true;
      }
    };

    return { codes, imask, isCode, submit, isErrorInput };
  },
};
</script>

<style lang="scss" scoped>
@import "@/app.scss";
</style>
